#### 📖 Terraform Plan ('infra-pe/resources/uat') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                     = (sensitive value)
          + "APPINSIGHTS_PROFILERFEATURE_VERSION"                = "1.0.0"
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                    = "100"
          + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION"                = "1.0.0"
          + "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT"          = ""
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"              = (sensitive value)
          + "AZURE_SUBSCRIPTION_ID"                              = (sensitive value)
          + "ApplicationInsightsAgent_EXTENSION_VERSION"         = "~3"
          + "CGN_APIM_PRODUCTID"                                 = (sensitive value)
          + "CGN_APIM_RESOURCE"                                  = (sensitive value)
          + "CGN_APIM_RESOURCEGROUP"                             = (sensitive value)
          + "CGN_ATTRIBUTE_AUTHORITY_BASE_URL"                   = (sensitive value)
          + "CGN_EMAIL_DEPARTMENT_EMAIL"                         = (sensitive value)
          + "CGN_EMAIL_NOTIFICATION_SENDER"                      = "CGN Portal<no-reply@cgn.pagopa.it>"
          + "CGN_EMAIL_PORTAL_BASE_URL"                          = (sensitive value)
          + "CGN_GEOLOCATION_SECRET_TOKEN"                       = (sensitive value)
          + "CGN_PE_DISCOUNT_BUCKET_MINCSVROWS"                  = "10000"
          + "CGN_PE_STORAGE_AZURE_ACCOUNT_KEY"                   = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_ACCOUNT_NAME"                  = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_BLOB_ENDPOINT"                 = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_DEFAULT_ENDPOINTS_PROTOCOL"    = "https"
          + "CGN_PE_STORAGE_AZURE_DOCUMENTS_CONTAINER_NAME"      = "userdocuments"
          + "CGN_PE_STORAGE_AZURE_IMAGED_CONTAINER_NAME"         = "profileimages"
          + "CGN_RECAPTCHA_SECRET_KEY"                           = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_PASSWORD"                    = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_URL"                         = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_USERNAME"                    = (sensitive value)
          + "DiagnosticServices_EXTENSION_VERSION"               = "~3"
          + "EYCA_EXPORT_ENABLED"                                = "false"
          + "EYCA_EXPORT_NOT_ALLOWED_DISCOUNT_MODES"             = "API"
          + "EYCA_EXPORT_PASSWORD"                               = (sensitive value)
          + "EYCA_EXPORT_USERNAME"                               = (sensitive value)
          + "InstrumentationEngine_EXTENSION_VERSION"            = "disabled"
          + "JAVA_OPTS"                                          = "-XX:+UseG1GC -XX:MaxGCPauseMillis=100 -XX:+UseStringDeduplication"
          + "MANAGEMENT_HEALTH_MAIL_ENABLED"                     = "false"
          + "SEND_DISCOUNTS_TO_EYCA_JOB_CRON"                    = "0 0 2 * * ? *"
          + "SERVER_PORT"                                        = "8080"
          + "SPRING_DATASOURCE_PASSWORD"                         = (sensitive value)
          + "SPRING_DATASOURCE_URL"                              = (sensitive value)
          + "SPRING_DATASOURCE_USERNAME"                         = (sensitive value)
          + "SPRING_MAIL_HOST"                                   = (sensitive value)
          + "SPRING_MAIL_PASSWORD"                               = (sensitive value)
          + "SPRING_MAIL_PORT"                                   = (sensitive value)
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_CONNECTIONTIMEOUT" = "10000"
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_TIMEOUT"           = "10000"
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_WRITETIMEOUT"      = "10000"
          + "SPRING_MAIL_USERNAME"                               = (sensitive value)
          + "SPRING_PROFILES_ACTIVE"                             = "prod"
          + "SPRING_QUARTZ_AUTOSTARTUP"                          = "false"
          + "SPRING_SERVLET_MULTIPART_MAX_FILE_SIZE"             = "200MB"
          + "SPRING_SERVLET_MULTIPART_MAX_REQUEST_SIZE"          = "200MB"
          + "SnapshotDebugger_EXTENSION_VERSION"                 = "disabled"
          + "WEBSITES_CONTAINER_START_TIME_LIMIT"                = "600"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                = "false"
          + "WEBSITES_PORT"                                      = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"    = "1"
          + "WEBSITE_DNS_SERVER"                                 = "168.63.129.16"
          + "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                    = "true"
          + "WEBSITE_RUN_FROM_PACKAGE"                           = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                      = "/actuator/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                  = "200"
          + "XDT_MicrosoftApplicationInsights_BaseExtensions"    = "disabled"
          + "XDT_MicrosoftApplicationInsights_Mode"              = "recommended"
          + "XDT_MicrosoftApplicationInsights_PreemptSdk"        = "disabled"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-u-itn-cgn-pe-onboarding-portal-backend-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-u-itn-cgn-pe-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/actuator/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "EYCA_EXPORT_ENABLED",
              + "SPRING_QUARTZ_AUTOSTARTUP",
              + "APPINSIGHTS_INSTRUMENTATIONKEY",
              + "APPINSIGHTS_PROFILERFEATURE_VERSION",
              + "APPINSIGHTS_SNAPSHOTFEATURE_VERSION",
              + "APPLICATIONINSIGHTS_CONFIGURATION_CONTENT",
              + "ApplicationInsightsAgent_EXTENSION_VERSION",
              + "DiagnosticServices_EXTENSION_VERSION",
              + "InstrumentationEngine_EXTENSION_VERSION",
              + "SnapshotDebugger_EXTENSION_VERSION",
              + "XDT_MicrosoftApplicationInsights_BaseExtensions",
              + "XDT_MicrosoftApplicationInsights_Mode",
              + "XDT_MicrosoftApplicationInsights_PreemptSdk",
            ]
        }
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                    = "100"
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"              = (sensitive value)
          + "AZURE_SUBSCRIPTION_ID"                              = (sensitive value)
          + "CGN_APIM_PRODUCTID"                                 = (sensitive value)
          + "CGN_APIM_RESOURCE"                                  = (sensitive value)
          + "CGN_APIM_RESOURCEGROUP"                             = (sensitive value)
          + "CGN_ATTRIBUTE_AUTHORITY_BASE_URL"                   = (sensitive value)
          + "CGN_EMAIL_DEPARTMENT_EMAIL"                         = (sensitive value)
          + "CGN_EMAIL_NOTIFICATION_SENDER"                      = "CGN Portal<no-reply@cgn.pagopa.it>"
          + "CGN_EMAIL_PORTAL_BASE_URL"                          = (sensitive value)
          + "CGN_GEOLOCATION_SECRET_TOKEN"                       = (sensitive value)
          + "CGN_PE_DISCOUNT_BUCKET_MINCSVROWS"                  = "10000"
          + "CGN_PE_STORAGE_AZURE_ACCOUNT_KEY"                   = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_ACCOUNT_NAME"                  = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_BLOB_ENDPOINT"                 = (sensitive value)
          + "CGN_PE_STORAGE_AZURE_DEFAULT_ENDPOINTS_PROTOCOL"    = "https"
          + "CGN_PE_STORAGE_AZURE_DOCUMENTS_CONTAINER_NAME"      = "userdocuments"
          + "CGN_PE_STORAGE_AZURE_IMAGED_CONTAINER_NAME"         = "profileimages"
          + "CGN_RECAPTCHA_SECRET_KEY"                           = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_PASSWORD"                    = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_URL"                         = (sensitive value)
          + "DOCKER_REGISTRY_SERVER_USERNAME"                    = (sensitive value)
          + "EYCA_EXPORT_ENABLED"                                = "false"
          + "EYCA_EXPORT_NOT_ALLOWED_DISCOUNT_MODES"             = "API"
          + "EYCA_EXPORT_PASSWORD"                               = (sensitive value)
          + "EYCA_EXPORT_USERNAME"                               = (sensitive value)
          + "JAVA_OPTS"                                          = "-XX:+UseG1GC -XX:MaxGCPauseMillis=100 -XX:+UseStringDeduplication"
          + "MANAGEMENT_HEALTH_MAIL_ENABLED"                     = "false"
          + "SEND_DISCOUNTS_TO_EYCA_JOB_CRON"                    = "0 0 2 * * ? *"
          + "SERVER_PORT"                                        = "8080"
          + "SPRING_DATASOURCE_PASSWORD"                         = (sensitive value)
          + "SPRING_DATASOURCE_URL"                              = (sensitive value)
          + "SPRING_DATASOURCE_USERNAME"                         = (sensitive value)
          + "SPRING_MAIL_HOST"                                   = (sensitive value)
          + "SPRING_MAIL_PASSWORD"                               = (sensitive value)
          + "SPRING_MAIL_PORT"                                   = (sensitive value)
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_CONNECTIONTIMEOUT" = "10000"
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_TIMEOUT"           = "10000"
          + "SPRING_MAIL_PROPERTIES_MAIL_SMTP_WRITETIMEOUT"      = "10000"
          + "SPRING_MAIL_USERNAME"                               = (sensitive value)
          + "SPRING_PROFILES_ACTIVE"                             = "prod"
          + "SPRING_QUARTZ_AUTOSTARTUP"                          = "false"
          + "SPRING_SERVLET_MULTIPART_MAX_FILE_SIZE"             = "200MB"
          + "SPRING_SERVLET_MULTIPART_MAX_REQUEST_SIZE"          = "200MB"
          + "WEBSITES_CONTAINER_START_TIME_LIMIT"                = "600"
          + "WEBSITES_ENABLE_APP_SERVICE_STORAGE"                = "false"
          + "WEBSITES_PORT"                                      = "8080"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"    = "1"
          + "WEBSITE_DNS_SERVER"                                 = "168.63.129.16"
          + "WEBSITE_ENABLE_SYNC_UPDATE_SITE"                    = "true"
          + "WEBSITE_RUN_FROM_PACKAGE"                           = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                      = "/actuator/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                  = "200"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/actuator/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
              + node_version             = "20-lts"
            }
        }
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-u-itn-cgn-pe-onboarding-portal-backend-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-u-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-u-itn-cgn-pe-onboarding-portal-backend-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-u-itn-cgn-pe-onboarding-portal-backend-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-u-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-u-itn-cgn-pe-vnet-01/subnets/io-u-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-u-itn-cgn-pe-onboarding-portal-backend-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "io-u-itn-cgn-pe-onboarding-portal-backend-asp-01"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "io-u-itn-cgn-pe-rg-01"
      + sku_name                     = "P0v3"
      + tags                         = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + worker_count                 = (known after apply)
      + zone_balancing_enabled       = true
    }

  # module.app_service_onboarding_portal_backend.module.app_service_onboarding_portal_backend.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.25.1.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-u-itn-cgn-pe-onboarding-portal-backend-app-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-u-itn-cgn-pe-rg-01"
      + virtual_network_name                           = "io-u-itn-cgn-pe-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
